feat: add diagram to readme.md
